HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxGtm_reg.h
/** \\brief  F044, ATOM AGC Enable/Disable Control Register */
#define GTM_ATOM4_AGC_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF010F044u)

/** \\brief  F048, ATOM AGC Enable/Disable Status Register */
#define GTM_ATOM4_AGC_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF010F048u)

/** \\brief  F058, ATOM AGC Force Update Control Register */
#define GTM_ATOM4_AGC_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF010F058u)

/** \\brief  F040, ATOM AGC Global control register */
#define GTM_ATOM4_AGC_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF010F040u)

/** \\brief  F05C, ATOM AGC Internal Trigger Control Register */
#define GTM_ATOM4_AGC_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF010F05Cu)

/** \\brief  F050, ATOM AGC Output Enable Control Register */
#define GTM_ATOM4_AGC_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF010F050u)

/** \\brief  F054, ATOM AGC Output Enable Status Register */
#define GTM_ATOM4_AGC_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF010F054u)

/** \\brief  F010, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH0_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F010u)

/** \\brief  F014, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH0_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F014u)

/** \\brief  F018, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH0_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F018u)

/** \\brief  F004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH0_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F004u)

/** \\brief  F024, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F024u)

/** \\brief  F028, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F028u)

/** \\brief  F02C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F02Cu)

/** \\brief  F020, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F020u)

/** \\brief  F000, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH0_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F000u)

/** \\brief  F004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH0_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010F004u)

/** Alias (User Manual Name) for GTM_ATOM4_CH0_SOMC.
* To use register names with standard convension, please use GTM_ATOM4_CH0_SOMC.
*/
#define	GTM_ATOM4_CH0_CTRL_SOMC	(GTM_ATOM4_CH0_SOMC)

/** \\brief  F004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH0_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010F004u)

/** Alias (User Manual Name) for GTM_ATOM4_CH0_SOMI.
* To use register names with standard convension, please use GTM_ATOM4_CH0_SOMI.
*/
#define	GTM_ATOM4_CH0_CTRL_SOMI	(GTM_ATOM4_CH0_SOMI)

/** \\brief  F004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH0_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010F004u)

/** Alias (User Manual Name) for GTM_ATOM4_CH0_SOMP.
* To use register names with standard convension, please use GTM_ATOM4_CH0_SOMP.
*/
#define	GTM_ATOM4_CH0_CTRL_SOMP	(GTM_ATOM4_CH0_SOMP)

/** \\brief  F004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH0_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010F004u)

/** Alias (User Manual Name) for GTM_ATOM4_CH0_SOMS.
* To use register names with standard convension, please use GTM_ATOM4_CH0_SOMS.
*/
#define	GTM_ATOM4_CH0_CTRL_SOMS	(GTM_ATOM4_CH0_SOMS)

/** \\brief  F008, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH0_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F008u)

/** \\brief  F00C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH0_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F00Cu)

/** \\brief  F01C, ATOM Channel Status Register */
#define GTM_ATOM4_CH0_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F01Cu)

/** \\brief  F090, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH1_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F090u)

/** \\brief  F094, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH1_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F094u)

/** \\brief  F098, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH1_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F098u)

/** \\brief  F084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F084u)

/** \\brief  F0A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F0A4u)

/** \\brief  F0A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F0A8u)

/** \\brief  F0AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F0ACu)

/** \\brief  F0A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F0A0u)

/** \\brief  F080, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH1_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F080u)

/** \\brief  F084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010F084u)

/** Alias (User Manual Name) for GTM_ATOM4_CH1_SOMC.
* To use register names with standard convension, please use GTM_ATOM4_CH1_SOMC.
*/
#define	GTM_ATOM4_CH1_CTRL_SOMC	(GTM_ATOM4_CH1_SOMC)

/** \\brief  F084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010F084u)

/** Alias (User Manual Name) for GTM_ATOM4_CH1_SOMI.
* To use register names with standard convension, please use GTM_ATOM4_CH1_SOMI.
*/
#define	GTM_ATOM4_CH1_CTRL_SOMI	(GTM_ATOM4_CH1_SOMI)

/** \\brief  F084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010F084u)

/** Alias (User Manual Name) for GTM_ATOM4_CH1_SOMP.
* To use register names with standard convension, please use GTM_ATOM4_CH1_SOMP.
*/
#define	GTM_ATOM4_CH1_CTRL_SOMP	(GTM_ATOM4_CH1_SOMP)

/** \\brief  F084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010F084u)

