HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM4_CH5_SOMI.
* To use register names with standard convension, please use GTM_ATOM4_CH5_SOMI.
*/
#define	GTM_ATOM4_CH5_CTRL_SOMI	(GTM_ATOM4_CH5_SOMI)

/** \\brief  F284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH5_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010F284u)

/** Alias (User Manual Name) for GTM_ATOM4_CH5_SOMP.
* To use register names with standard convension, please use GTM_ATOM4_CH5_SOMP.
*/
#define	GTM_ATOM4_CH5_CTRL_SOMP	(GTM_ATOM4_CH5_SOMP)

/** \\brief  F284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH5_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010F284u)

/** Alias (User Manual Name) for GTM_ATOM4_CH5_SOMS.
* To use register names with standard convension, please use GTM_ATOM4_CH5_SOMS.
*/
#define	GTM_ATOM4_CH5_CTRL_SOMS	(GTM_ATOM4_CH5_SOMS)

/** \\brief  F288, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH5_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F288u)

/** \\brief  F28C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH5_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F28Cu)

/** \\brief  F29C, ATOM Channel Status Register */
#define GTM_ATOM4_CH5_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F29Cu)

/** \\brief  F310, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH6_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F310u)

/** \\brief  F314, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH6_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F314u)

/** \\brief  F318, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH6_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F318u)

/** \\brief  F304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F304u)

/** \\brief  F324, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F324u)

/** \\brief  F328, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F328u)

/** \\brief  F32C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F32Cu)

/** \\brief  F320, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F320u)

/** \\brief  F300, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH6_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F300u)

/** \\brief  F304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH6_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010F304u)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_SOMC.
* To use register names with standard convension, please use GTM_ATOM4_CH6_SOMC.
*/
#define	GTM_ATOM4_CH6_CTRL_SOMC	(GTM_ATOM4_CH6_SOMC)

/** \\brief  F304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH6_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010F304u)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_SOMI.
* To use register names with standard convension, please use GTM_ATOM4_CH6_SOMI.
*/
#define	GTM_ATOM4_CH6_CTRL_SOMI	(GTM_ATOM4_CH6_SOMI)

/** \\brief  F304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH6_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010F304u)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_SOMP.
* To use register names with standard convension, please use GTM_ATOM4_CH6_SOMP.
*/
#define	GTM_ATOM4_CH6_CTRL_SOMP	(GTM_ATOM4_CH6_SOMP)

/** \\brief  F304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH6_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010F304u)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_SOMS.
* To use register names with standard convension, please use GTM_ATOM4_CH6_SOMS.
*/
#define	GTM_ATOM4_CH6_CTRL_SOMS	(GTM_ATOM4_CH6_SOMS)

/** \\brief  F308, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F308u)

/** \\brief  F30C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F30Cu)

/** \\brief  F31C, ATOM Channel Status Register */
#define GTM_ATOM4_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F31Cu)

/** \\brief  F390, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F390u)

/** \\brief  F394, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F394u)

/** \\brief  F398, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F398u)

/** \\brief  F384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F384u)

/** \\brief  F3A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F3A4u)

/** \\brief  F3A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F3A8u)

/** \\brief  F3AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F3ACu)

/** \\brief  F3A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F3A0u)

/** \\brief  F380, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH7_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F380u)

/** \\brief  F384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH7_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010F384u)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_SOMC.
* To use register names with standard convension, please use GTM_ATOM4_CH7_SOMC.
*/
#define	GTM_ATOM4_CH7_CTRL_SOMC	(GTM_ATOM4_CH7_SOMC)

/** \\brief  F384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH7_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010F384u)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_SOMI.
* To use register names with standard convension, please use GTM_ATOM4_CH7_SOMI.
*/
#define	GTM_ATOM4_CH7_CTRL_SOMI	(GTM_ATOM4_CH7_SOMI)

/** \\brief  F384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH7_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010F384u)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_SOMP.
* To use register names with standard convension, please use GTM_ATOM4_CH7_SOMP.
*/
#define	GTM_ATOM4_CH7_CTRL_SOMP	(GTM_ATOM4_CH7_SOMP)

/** \\brief  F384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH7_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010F384u)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_SOMS.
* To use register names with standard convension, please use GTM_ATOM4_CH7_SOMS.
*/
#define	GTM_ATOM4_CH7_CTRL_SOMS	(GTM_ATOM4_CH7_SOMS)

/** \\brief  F388, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F388u)

